tiborsimon/embedded-tdd-headers/pic/8bit/pic18f8621_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F8621_H_
#define _PIC18F8621_H_

#define ECCP2DEL                      0
#define P2DC0                         1
#define P2DC                          2
#define ECCP2DEL_PDC0                 3
#define P2DC1                         4
#define ECCP2DEL_PDC1                 5
#define P2DC2                         6
#define ECCP2DEL_PDC2                 7
#define P2DC3                         8
#define ECCP2DEL_PDC3                 9
#define P2DC4                         10
#define ECCP2DEL_PDC4                 11
#define P2DC5                         12
#define ECCP2DEL_PDC5                 13
#define P2DC6                         14
#define ECCP2DEL_PDC6                 15
#define ECCP2DEL_PRSEN                16
#define P2RSEN                        17
#define PSS2BD                        18
#define PSS2BD0                       19
#define ECCP2AS_PSSBD0                20
#define PSS2BD1                       21
#define ECCP2AS_PSSBD1                22
#define PSS2AC0                       23
#define ECCP2AS_PSSAC0                24
#define PSS2AC                        25
#define PSS2AC1                       26
#define ECCP2AS_PSSAC1                27
#define ECCP2AS0                      28
#define ECCP2AS                       29
#define ECCP2AS1                      30
#define ECCP2AS2                      31
#define ECCP2ASE                      32
#define ECCP3DEL                      33
#define ECCP3DEL_PDC0                 34
#define P3DC0                         35
#define P3DC                          36
#define ECCP3DEL_PDC1                 37
#define P3DC1                         38
#define ECCP3DEL_PDC2                 39
#define P3DC2                         40
#define ECCP3DEL_PDC3                 41
#define P3DC3                         42
#define ECCP3DEL_PDC4                 43
#define P3DC4                         44
#define ECCP3DEL_PDC5                 45
#define P3DC5                         46
#define ECCP3DEL_PDC6                 47
#define P3DC6                         48
#define P3RSEN                        49
#define ECCP3DEL_PRSEN                50
#define PSS3BD0                       51
#define ECCP3AS_PSSBD0                52
#define PSS3BD                        53
#define PSS3BD1                       54
#define ECCP3AS_PSSBD1                55
#define PSS3AC0                       56
#define ECCP3AS_PSSAC0                57
#define PSS3AC                        58
#define ECCP3AS_PSSAC1                59
#define PSS3AC1                       60
#define ECCP3AS                       61
#define ECCP3AS0                      62
#define ECCP3AS1                      63
#define ECCP3AS2                      64
#define ECCP3ASE                      65
#define RCSTA2                        66
#define RCD82                         67
#define RX9D2                         68
#define RCSTA2_RX9D                   69
#define RCSTA2_OERR                   70
#define OERR2                         71
#define FERR2                         72
#define RCSTA2_FERR                   73
#define ADEN2                         74
#define RCSTA2_ADEN                   75
#define ADDEN2                        76
#define RCSTA2_ADDEN                  77
#define RCSTA2_CREN                   78
#define CREN2                         79
#define SREN2                         80
#define RCSTA2_SREN                   81
#define RC92                          82
#define RC8_92                        83
#define RCSTA2_RX9                    84
#define RX92                          85
#define RCSTA2_SPEN                   86
#define SPEN2                         87
#define TXSTA2                        88
#define TX9D2                         89
#define TXSTA2_TX9D                   90
#define TXD82                         91
#define TRMT2                         92
#define TXSTA2_TRMT                   93
#define BRGH2                         94
#define TXSTA2_BRGH                   95
#define SENDB2                        96
#define TXSTA2_SENDB                  97
#define TXSTA2_SYNC                   98
#define SYNC2                         99
#define TXEN2                         100
#define TXSTA2_TXEN                   101
#define TX8_92                        102
#define TX92                          103
#define TXSTA2_TX9                    104
#define TXSTA2_CSRC                   105
#define CSRC2                         106
#define CCP5CON                       107
#define CCP5M0                        108
#define CCP5M                         109
#define CCP5M1                        110
#define CCP5M2                        111
#define CCP5M3                        112
#define CCP5Y                         113
#define DC5B0                         114
#define DC5B                          115
#define CCP5X                         116
#define DC5B1                         117
#define CCP4CON                       118
#define CCP4M                         119
#define CCP4M0                        120
#define CCP4M1                        121
#define CCP4M2                        122
#define CCP4M3                        123
#define CCP4Y                         124
#define DC4B0                         125
#define DC4B                          126
#define CCP4X                         127
#define DC4B1                         128
#define T4CON                         129
#define T4CKPS0                       130
#define T4CKPS                        131
#define T4CKPS1                       132
#define TMR4ON                        133
#define T4OUTPS                       134
#define TOUTPS0                       135
#define T4OUTPS0                      136
#define T4OUTPS1                      137
#define TOUTPS1                       138
#define TOUTPS2                       139
#define T4OUTPS2                      140
#define TOUTPS3                       141
#define T4OUTPS3                      142
#define ECCP1DEL                      143
#define P1DC0                         144
#define ECCP1DEL_PDC0                 145
#define P1DC                          146
#define P1DC1                         147
#define ECCP1DEL_PDC1                 148
#define P1DC2                         149
#define ECCP1DEL_PDC2                 150
#define P1DC3                         151
#define ECCP1DEL_PDC3                 152
#define P1DC4                         153
#define ECCP1DEL_PDC4                 154
#define P1DC5                         155
#define ECCP1DEL_PDC5                 156
#define P1DC6                         157
#define ECCP1DEL_PDC6                 158
#define P1RSEN                        159
#define P1DC7                         160
#define ECCP1DEL_PRSEN                161
#define BAUDCON2                      162
#define ABDEN2                        163
#define BAUDCON2_ABDEN                164
#define WUE2                          165
#define BAUDCON2_WUE                  166
#define BRG162                        167
#define BAUDCON2_BRG16                168
#define SCKP2                         169
#define BAUDCON2_SCKP                 170
#define TXCKP2                        171
#define BAUDCON2_RCMT                 172
#define BAUDCON2_RCIDL                173
#define RCMT2                         174
#define RCIDL2                        175
#define BAUDCON1                      176
#define ABDEN1                        177
#define BAUDCON1_ABDEN                178
#define BAUDCON1_WUE                  179
#define WUE1                          180
#define W4E                           181
#define BAUDCON1_BRG16                182
#define BRG161                        183
#define TXCKP                         184
#define SCKP1                         185
#define TXCKP1                        186
#define BAUDCON1_SCKP                 187
#define CKTXP                         188
#define BAUDCON1_RCIDL                189
#define BAUDCON1_RCMT                 190
#define RCIDL1                        191
#define RCMT1                         192
#define PORTA                         193
#define AN0                           194
#define PORTA_RA0                     195
#define ULPWUIN                       196
#define AN1                           197
#define PORTA_RA1                     198
#define AN2                           199
#define PORTA_RA2                     200
#define VREFM                         201
#define AN3                           202
#define PORTA_RA3                     203
#define VREFP                         204
#define PORTA_RA4                     205
#define T0CKI                         206
#define AN4                           207
#define PORTA_RA5                     208
#define LVDIN                         209
#define CLKO                          210
#define PORTA_RA6                     211
#define OSC2                          212
#define PORTB                         213
#define INT0                          214
#define PORTB_RB0                     215
#define INT1                          216
#define PORTB_RB1                     217
#define INT2                          218
#define PORTB_RB2                     219
#define INT3                          220
#define CCP2_PA2                      221
#define PORTB_RB3                     222
#define RB4                           223
#define KBI0                          224
#define PGM                           225
#define KBI1                          226
#define PORTB_RB5                     227
#define PGC                           228
#define KBI2                          229
#define PORTB_RB6                     230
#define PGD                           231
#define KBI3                          232
#define PORTB_RB7                     233
#define PORTC                         234
#define T13CKI                        235
#define T1OSO                         236
#define PORTC_RC0                     237
#define CCP2                          238
#define T1OSI                         239
#define PORTC_RC1                     240
#define PA2                           241
#define CCP1                          242
#define P1A                           243
#define PA1                           244
#define PORTC_RC2                     245
#define SCL                           246
#define SCK                           247
#define PORTC_RC3                     248
#define SDA                           249
#define SDI                           250
#define PORTC_RC4                     251
#define SDO                           252
#define PORTC_RC5                     253
#define PORTC_RC6                     254
#define TX1                           255
#define CK1                           256
#define RX1                           257
#define DT1                           258
#define PORTC_RC7                     259
#define PORTD                         260
#define PSP0                          261
#define PORTD_RD0                     262
#define AD0                           263
#define PSP1                          264
#define PORTD_RD1                     265
#define AD1                           266
#define PSP2                          267
#define AD2                           268
#define PORTD_RD2                     269
#define PSP3                          270
#define AD3                           271
#define PORTD_RD3                     272
#define PORTD_RD4                     273
#define PSP4                          274
#define AD4                           275
#define PSP5                          276
#define AD5                           277
#define PORTD_RD5                     278
#define PSP6                          279
#define AD6                           280
#define PORTD_RD6                     281
#define SS2                           282
#define PSP7                          283
#define AD7                           284
#define PORTD_RD7                     285
#define PORTE                         286
#define P2D                           287
#define PORTE_RD                      288
#define PD2                           289
#define AD8                           290
#define RDE                           291
#define PORTE_RE0                     292
#define P2C                           293
#define PORTE_WR                      294
#define WRE                           295
#define AD9                           296
#define PORTE_RE1                     297
#define PC2                           298
#define P2B                           299
#define CS                            300
#define CCP10                         301
#define PB2                           302
#define PORTE_RE2                     303
#define AD10                          304
#define PORTE_RE3                     305
#define CCP9E                         306
#define P3C                           307
#define AD11                          308
#define PC3E                          309
#define PORTE_RE4                     310
#define PB3E                          311
#define P3B                           312
#define AD12                          313
#define CCP8E                         314
#define PORTE_RE5                     315
#define P1C                           316
#define CCP7E                         317
#define AD13                          318
#define PC1E                          319
#define CCP6E                         320
#define PORTE_RE6                     321
#define P1B                           322
#define AD14                          323
#define PB1E                          324
#define CCP2E                         325
#define PA2E                          326
#define PORTE_RE7                     327
#define AD15                          328
#define PORTF                         329
#define PORTF_RF0                     330
#define AN5                           331
#define PORTF_RF1                     332
#define C2OUTF                        333
#define AN6                           334
#define PORTF_RF2                     335
#define AN7                           336
#define C1OUTF                        337
#define PORTF_RF3                     338
#define AN8                           339
#define PORTF_RF4                     340
#define AN9                           341
#define PORTF_RF5                     342
#define AN10                          343
#define CVREFF                        344
#define PORTF_RF6                     345
#define AN11                          346
#define PORTF_RF7                     347
#define SS                            348
#define PORTG                         349
#define CCP3                          350
#define P3A                           351
#define PORTG_RG0                     352
#define C3OUTG                        353
#define TX2                           354
#define PORTG_RG1                     355
#define CK2                           356
#define RX2                           357
#define PORTG_RG2                     358
#define DT2                           359
#define CCP4                          360
#define P3D                           361
#define PORTG_RG3                     362
#define CCP5                          363
#define PORTG_RG4                     364
#define P1D                           365
#define VPP                           366
#define RG5                           367
#define MCLR                          368
#define RJPU                          369
#define PORTH                         370
#define PORTH_RH0                     371
#define AD16                          372
#define PORTH_RH1                     373
#define AD17                          374
#define PORTH_RH2                     375
#define AD18                          376
#define PORTH_RH3                     377
#define AD19                          378
#define PORTH_RH4                     379
#define CCP9                          380
#define PC3                           381
#define AN12                          382
#define PORTH_RH5                     383
#define CCP8                          384
#define PB3                           385
#define AN13                          386
#define PORTH_RH6                     387
#define CCP7                          388
#define PC1                           389
#define AN14                          390
#define PORTH_RH7                     391
#define CCP6                          392
#define PB1                           393
#define AN15                          394
#define PORTJ                         395
#define ALE                           396
#define PORTJ_RJ0                     397
#define OE                            398
#define PORTJ_RJ1                     399
#define WRL                           400
#define PORTJ_RJ2                     401
#define WRH                           402
#define PORTJ_RJ3                     403
#define BA0                           404
#define PORTJ_RJ4                     405
#define CE                            406
#define PORTJ_RJ5                     407
#define LB                            408
#define PORTJ_RJ6                     409
#define PORTJ_RJ7                     410
#define UB                            411
#define LATA                          412
#define LATA0                         413
#define LA0                           414
#define LATA1                         415
#define LA1                           416
#define LATA2                         417
#define LA2                           418
#define LATA3                         419
#define LA3                           420
#define LATA4                         421
#define LA4                           422
#define LATA5                         423
#define LA5                           424
#define LATA6                         425
#define LA6                           426
#define LATB                          427
#define LB0                           428
#define LATB0                         429
#define LB1                           430
#define LATB1                         431
#define LB2                           432
#define LATB2                         433
#define LB3                           434
#define LATB3                         435
#define LB4                           436
#define LATB4                         437
#define LB5                           438
#define LATB5                         439
#define LB6                           440
#define LATB6                         441
#define LB7                           442
#define LATB7                         443
#define LATC                          444
#define LATC0                         445
#define LC0                           446
#define LATC1                         447
#define LC1                           448
#define LATC2                         449
#define LC2                           450
#define LATC3                         451
#define LC3                           452
#define LATC4                         453
#define LC4                           454
#define LATC5                         455
#define LC5                           456
#define LATC6                         457
#define LC6                           458
#define LATC7                         459
#define LC7                           460
#define LATD                          461
#define LATD0                         462
#define LD0                           463
#define LATD1                         464
#define LD1                           465
#define LATD2                         466
#define LD2                           467
#define LATD3                         468
#define LD3                           469
#define LATD4                         470
#define LD4                           471
#define LATD5                         472
#define LD5                           473
#define LATD6                         474
#define LD6                           475
#define LATD7                         476
#define LD7                           477
#define LATE                          478
#define LATE0                         479
#define LE0                           480
#define LATE1                         481
#define LE1                           482
#define LATE2                         483
#define LE2                           484
#define LATE3                         485
#define LE3                           486
#define LATE4                         487
#define LE4                           488
#define LATE5                         489
#define LE5                           490
#define LATE6                         491
#define LE6                           492
#define LATE7                         493
#define LE7                           494
#define LATF                          495
#define LATF0                         496
#define LF0                           497
#define LATF1                         498
#define LF1                           499
#define LF2                           500
#define LATF2                         501
#define LF3                           502
#define LATF3                         503
#define LF4                           504
#define LATF4                         505
#define LF5                           506
#define LATF5                         507
#define LF6                           508
#define LATF6                         509
#define LF7                           510
#define LATF7                         511
#define LATG                          512
#define LATG0                         513
#define LG0                           514
#define LATG1                         515
#define LG1                           516
#define LATG2                         517
#define LG2                           518
#define LATG3                         519
#define LG3                           520
#define LATG4                         521
