tiborsimon/embedded-tdd-headers/pic/8bit/pic18f8621_tdd.h
#define LVDL2                         1091
#define LVV3                          1092
#define LVDL3                         1093
#define LVDEN                         1094
#define BGST                          1095
#define IRVST                         1096
#define OSCCON                        1097
#define SCS0                          1098
#define SCS                           1099
#define SCS1                          1100
#define PLLEN                         1101
#define LOCK                          1102
#define T0CON                         1103
#define T0PS                          1104
#define T0PS0                         1105
#define T0PS1                         1106
#define T0PS2                         1107
#define PSA                           1108
#define T0SE                          1109
#define T0CS                          1110
#define T08BIT                        1111
#define TMR0ON                        1112
#define STATUS                        1113
#define C                             1114
#define CARRY                         1115
#define DC                            1116
#define ZERO                          1117
#define Z                             1118
#define OV                            1119
#define OVERFLOW                      1120
#define N                             1121
#define NEGATIVE                      1122
#define INTCON3                       1123
#define INT1IF                        1124
#define INT1F                         1125
#define INT2IF                        1126
#define INT2F                         1127
#define INT3F                         1128
#define INT3IF                        1129
#define INT1E                         1130
#define INT1IE                        1131
#define INT2IE                        1132
#define INT2E                         1133
#define INT3E                         1134
#define INT3IE                        1135
#define INT1P                         1136
#define INT1IP                        1137
#define INT2IP                        1138
#define INT2P                         1139
#define INTCON2                       1140
#define RBIP                          1141
#define INT3IP                        1142
#define INT3P                         1143
#define TMR0IP                        1144
#define T0IP                          1145
#define INTEDG3                       1146
#define INTEDG2                       1147
#define INTEDG1                       1148
#define INTEDG0                       1149
#define RBPU                          1150
#define NOT_RBPU                      1151
#define nRBPU                         1152
#define INTCON                        1153
#define RBIF                          1154
#define INT0F                         1155
#define INT0IF                        1156
#define T0IF                          1157
#define TMR0IF                        1158
#define RBIE                          1159
#define INT0E                         1160
#define INT0IE                        1161
#define T0IE                          1162
#define TMR0IE                        1163
#define PEIE                          1164
#define PEIE_GIEL                     1165
#define GIEL                          1166
#define GIE_GIEH                      1167
#define GIE                           1168
#define GIEH                          1169
#define STKPTR0                       1170
#define STKPTR                        1171
#define STKPTR1                       1172
#define STKPTR2                       1173
#define STKPTR3                       1174
#define STKPTR4                       1175
#define STKUNF                        1176
#define STKOVF                        1177
#define STKFUL                        1178

#endif // _PIC18F8621_H_
